src/ExchangePlans/ОбменУправлениеТорговлейWMS4/ОбменУправлениеТорговлейWMS4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="d6091462-ada7-4031-9a25-8e797ed63907">
  <name>ОбменУправлениеТорговлейWMS4</name>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Для идентификации узла источника при обмене</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьПоклажедателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаВыгрузкиДокументов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

src/ExchangePlans/ОбменУправлениеТорговлейWMS4/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает настройки используемых узлов плана обмена,
// кроме текущего узла и помеченных на удаление
//
// Возвращаемое значение:
//   Таблица значений 
// 		* Узел 
// 		* Наименование
// 		* Идентификатор 
// 		* URL
// 		* Пользователь
// 		* Пароль
// 		* Склад
//   
//@skip-check module-accessibility-at-client
Функция ПолучитьНастройкиУзлов() Экспорт
	
	ТектстЗапроса = "ВЫБРАТЬ
	|	ОбменУправлениеТорговлейWMS4.Ссылка КАК Узел,
	|	ОбменУправлениеТорговлейWMS4.Наименование КАК Наименование,
	|	ОбменУправлениеТорговлейWMS4.Идентификатор КАК Идентификатор,
	|	ОбменУправлениеТорговлейWMS4.URL КАК URL,
	|	ОбменУправлениеТорговлейWMS4.Пользователь КАК Пользователь,
	|	ОбменУправлениеТорговлейWMS4.Пароль КАК Пароль
	|ПОМЕСТИТЬ втНастройкиОбмена
	|ИЗ
	|	ПланОбмена.ОбменУправлениеТорговлейWMS4 КАК ОбменУправлениеТорговлейWMS4
	|ГДЕ
	|	ОбменУправлениеТорговлейWMS4.Используется
	|	И НЕ ОбменУправлениеТорговлейWMS4.ПометкаУдаления
	|	И НЕ ОбменУправлениеТорговлейWMS4.ЭтотУзел
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Узел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбменУправлениеТорговлейWMS4Склады.Ссылка КАК Узел,
	|	ОбменУправлениеТорговлейWMS4Склады.Склад КАК Склад
	|ПОМЕСТИТЬ втУзелСклад
	|ИЗ
	|	ПланОбмена.ОбменУправлениеТорговлейWMS4.Склады КАК ОбменУправлениеТорговлейWMS4Склады
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбменУправлениеТорговлейWMS4Склады.Ссылка,
	|	ОбменУправлениеТорговлейWMS4Склады.Склад
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Узел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНастройкиОбмена.Узел КАК Узел,
	|	втНастройкиОбмена.Наименование КАК Наименование,
	|	втНастройкиОбмена.Идентификатор КАК Идентификатор,
	|	втНастройкиОбмена.URL КАК URL,
	|	втНастройкиОбмена.Пользователь КАК Пользователь,
	|	втНастройкиОбмена.Пароль КАК Пароль,
	|	втУзелСклад.Склад КАК Склад
	|ИЗ
	|	втНастройкиОбмена КАК втНастройкиОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втУзелСклад КАК втУзелСклад
	|		ПО втНастройкиОбмена.Узел = втУзелСклад.Узел";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТектстЗапроса;	
	Возврат Запрос.Выполнить().Выгрузить();;
	
КонецФункции

// Возвращает склады узлов плана обмена
//
// Возвращаемое значение:
//   Массив - Массив складов по используемым узлам плана обмена ОбменУправлениеТорговлейWMS4, 
//   		  кроме текущего узла и помеченных на удаление
Функция ПолучитьСкладыУзловПланаОбмена() Экспорт
	
	ТектстЗапроса = 
	"ВЫБРАТЬ
	|	ОбменУправлениеТорговлейWMS4.Ссылка КАК Узел
	|ПОМЕСТИТЬ втУзлыПланаОбмена
	|ИЗ
	|	ПланОбмена.ОбменУправлениеТорговлейWMS4 КАК ОбменУправлениеТорговлейWMS4
	|ГДЕ
	|	ОбменУправлениеТорговлейWMS4.Используется
	|	И НЕ ОбменУправлениеТорговлейWMS4.ПометкаУдаления
	|	И НЕ ОбменУправлениеТорговлейWMS4.ЭтотУзел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбменУправлениеТорговлейWMS4Склады.Ссылка КАК Узел,
	|	ОбменУправлениеТорговлейWMS4Склады.Склад КАК Склад
	|ПОМЕСТИТЬ втУзелСклад
	|ИЗ
	|	ПланОбмена.ОбменУправлениеТорговлейWMS4.Склады КАК ОбменУправлениеТорговлейWMS4Склады
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втУзелСклад.Склад КАК Склад
	|ИЗ
	|	втУзлыПланаОбмена КАК втУзлыПланаОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втУзелСклад КАК втУзелСклад
	|		ПО втУзлыПланаОбмена.Узел = втУзелСклад.Узел";
	                                                                  
	Запрос = Новый Запрос;
	Запрос.Текст = ТектстЗапроса;	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
	
КонецФункции

// Возвращает узлы плана обмена у которых в списке складов присутствует переданный склад
//
// Параметры:
//	Склад - СправочникСсылка.Склады - склад по которому ищется узел плана обмена
//
// Возвращаемое значение:
//   Массив - Массив узлов плана обмена ОбменУправлениеТорговлейWMS4, 
//   		  кроме текущего узла и помеченных на удаление
//
Функция ТаблицаУзлыПланаОбмена(СписокСкладов = Неопределено) Экспорт
	
	ШаблонТекстаЗапроса = "ВЫБРАТЬ
	|	ОбменУправлениеТорговлейWMS4Склады.Ссылка КАК УзелОбменаСсылка,
	|	ПРЕДСТАВЛЕНИЕ(ОбменУправлениеТорговлейWMS4Склады.Ссылка) КАК Представление
	|ИЗ
	|	ПланОбмена.ОбменУправлениеТорговлейWMS4.Склады КАК ОбменУправлениеТорговлейWMS4Склады
	|ГДЕ
	|	ОбменУправлениеТорговлейWMS4Склады.ДатаНачалаВыгрузкиДокументов < &ТекущаяДата
	|	И ОбменУправлениеТорговлейWMS4Склады.Ссылка.Используется
	|	И НЕ ОбменУправлениеТорговлейWMS4Склады.Ссылка.ПометкаУдаления
	|	И НЕ ОбменУправлениеТорговлейWMS4Склады.Ссылка.ЭтотУзел
	|	[ОтборПоСкладам]		  
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбменУправлениеТорговлейWMS4Склады.Ссылка";
		
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Если  СписокСкладов <> Неопределено Тогда 
		
		Запрос.Текст = СтрЗаменить(ШаблонТекстаЗапроса,
		"[ОтборПоСкладам]",  "И ОбменУправлениеТорговлейWMS4Склады.Склад В(&СписокСкладов)");
		
		Запрос.УстановитьПараметр("СписокСкладов", СписокСкладов);
		
	Иначе 
		
		Запрос.Текст = СокрЛП(СтрЗаменить(ШаблонТекстаЗапроса, "[ОтборПоСкладам]",  ""));
		
	КонецЕсли;
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


// Возвращает узлы плана обмена у которых в списке складов присутствует переданный склад
//
// Параметры:
//	Склад - СправочникСсылка.Склады - склад по которому ищется узел плана обмена
//
// Возвращаемое значение:
//   Массив - Массив узлов плана обмена ОбменУправлениеТорговлейWMS4, 
//   		  кроме текущего узла и помеченных на удаление
//
Функция УзлыПланаОбменаПоСкладу(Склад) Экспорт
	
	ТектстЗапроса = 
	"ВЫБРАТЬ
	|	ОбменУправлениеТорговлейWMS4.Ссылка КАК Узел
	|ПОМЕСТИТЬ втУзлыПланаОбмена
	|ИЗ
	|	ПланОбмена.ОбменУправлениеТорговлейWMS4 КАК ОбменУправлениеТорговлейWMS4
	|ГДЕ
	|	ОбменУправлениеТорговлейWMS4.Используется
	|	И НЕ ОбменУправлениеТорговлейWMS4.ПометкаУдаления
	|	И НЕ ОбменУправлениеТорговлейWMS4.ЭтотУзел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбменУправлениеТорговлейWMS4Склады.Ссылка КАК Узел,
	|	ОбменУправлениеТорговлейWMS4Склады.Склад КАК Склад
	|ПОМЕСТИТЬ втУзелСклад
	|ИЗ
	|	ПланОбмена.ОбменУправлениеТорговлейWMS4.Склады КАК ОбменУправлениеТорговлейWMS4Склады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втУзлыПланаОбмена.Узел КАК Узел
	|ИЗ
	|	втУзлыПланаОбмена КАК втУзлыПланаОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втУзелСклад КАК втУзелСклад
	|		ПО втУзлыПланаОбмена.Узел = втУзелСклад.Узел
	|			И (втУзелСклад.Склад = &Склад)";
	                                                                  
	Запрос = Новый Запрос;
	Запрос.Текст = ТектстЗапроса;
	Запрос.УстановитьПараметр("Склад", Склад);
	
	//Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Узел");
	
	//Возврат Не Результат.Пустой();
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Узел");
	
КонецФункции

#КонецОбласти
